tap "dracula/install"
tap "homebrew/bundle"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Software library to render fonts
brew "freetype"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Terminal-based visual file manager
brew "midnight-commander"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Draw UML diagrams
brew "plantuml"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Terminal multiplexer
brew "tmux"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Memory training application
cask "anki"
# Universal database tool and SQL client
cask "dbeaver-community"
# Dark theme for Terminal.app
cask "dracula-terminal"
# Web browser
cask "firefox"
# Clipboard manager
cask "maccy"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# QuickLook plugin to preview .strings files
cask "stringsfile"
# Quicklook extension for source files
cask "syntax-highlight"
# Open-source BitTorrent client
cask "transmission"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
vscode "bradgashler.htmltagwrap"
vscode "dracula-theme.theme-dracula"
vscode "jebbs.plantuml"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ritwickdey.LiveServer"
vscode "vscodevim.vim"
vscode "well-ar.plantuml"
