adduser
alsa-topology-conf
alsa-ucm-conf
apparmor
apport
apport-symptoms
apt
apt-utils
at-spi2-core
base-files
base-passwd
bash
bash-completion
bat
bind9-dnsutils
bind9-host
bind9-libs:amd64
binutils
binutils-common:amd64
binutils-x86-64-linux-gnu
bridge-utils
bsdextrautils
bsdutils
busybox-static
byobu
bzip2
ca-certificates
ca-certificates-java
caca-utils
chafa
command-not-found
console-setup
console-setup-linux
containerd
coreutils
cpio
cron
curl
dash
dbus
dbus-x11
dconf-gsettings-backend:amd64
dconf-service
debconf
debconf-i18n
debianutils
default-jre
default-jre-headless
diffutils
dirmngr
distro-info
distro-info-data
dmidecode
dmsetup
dns-root-data
dnsmasq-base
docker-compose
docker.io
dosfstools
dpkg
e2fsprogs
ed
eject
exa
file
findutils
fontconfig
fontconfig-config
fonts-dejavu-core
fonts-dejavu-extra
fonts-droid-fallback
fonts-noto-mono
fonts-ubuntu
fonts-urw-base35
friendly-recovery
ftp
fuse3
fzf
gawk
gcc-12-base:amd64
gettext-base
ghostscript
gir1.2-glib-2.0:amd64
gir1.2-packagekitglib-1.0
git
git-man
gnupg
gnupg-l10n
gnupg-utils
gpg
gpg-agent
gpg-wks-client
gpg-wks-server
gpgconf
gpgsm
gpgv
grep
groff-base
gsettings-desktop-schemas
gsfonts
gzip
hdparm
hicolor-icon-theme
hostname
htop
imagemagick
imagemagick-6-common
imagemagick-6.q16
info
init
init-system-helpers
install-info
iproute2
iptables
iputils-ping
iputils-tracepath
irqbalance
isc-dhcp-client
isc-dhcp-common
iso-codes
java-common
jp2a
kbd
keyboard-configuration
kmod
less
libacl1:amd64
libaom3:amd64
libapparmor1:amd64
libappstream4:amd64
libapt-pkg6.0:amd64
libargon2-1:amd64
libasound2:amd64
libasound2-data
libassuan0:amd64
libatk-bridge2.0-0:amd64
libatk-wrapper-java
libatk-wrapper-java-jni:amd64
libatk1.0-0:amd64
libatk1.0-data
libatm1:amd64
libatspi2.0-0:amd64
libattr1:amd64
libaudit-common
libaudit1:amd64
libavahi-client3:amd64
libavahi-common-data:amd64
libavahi-common3:amd64
libbinutils:amd64
libblkid1:amd64
libbpf0:amd64
libbrotli1:amd64
libbsd0:amd64
libbz2-1.0:amd64
libc-bin
libc6:amd64
libcaca0:amd64
libcairo2:amd64
libcap-ng0:amd64
libcap2:amd64
libcap2-bin
libcbor0.8:amd64
libchafa0:amd64
libcom-err2:amd64
libcrypt1:amd64
libcryptsetup12:amd64
libctf-nobfd0:amd64
libctf0:amd64
libcups2:amd64
libcurl3-gnutls:amd64
libcurl4:amd64
libdatrie1:amd64
libdav1d5:amd64
libdb5.3:amd64
libdbus-1-3:amd64
libdconf1:amd64
libde265-0:amd64
libdebconfclient0:amd64
libdeflate0:amd64
libdevmapper1.02.1:amd64
libdjvulibre-text
libdjvulibre21:amd64
libdns-export1110
libdrm-amdgpu1:amd64
libdrm-common
libdrm-intel1:amd64
libdrm-nouveau2:amd64
libdrm-radeon1:amd64
libdrm2:amd64
libdw1:amd64
libedit2:amd64
libelf1:amd64
liberror-perl
libestr0:amd64
libevent-core-2.1-7:amd64
libexpat1:amd64
libext2fs2:amd64
libfastjson4:amd64
libffi8:amd64
libfftw3-double3:amd64
libfido2-1:amd64
libfontconfig1:amd64
libfontenc1:amd64
libfreetype6:amd64
libfribidi0:amd64
libfuse3-3:amd64
libgc1:amd64
libgcc-s1:amd64
libgcrypt20:amd64
libgdbm-compat4:amd64
libgdbm6:amd64
libgif7:amd64
libgirepository-1.0-1:amd64
libgit2-1.1:amd64
libgl1:amd64
libgl1-amber-dri:amd64
libgl1-mesa-dri:amd64
libglapi-mesa:amd64
libglib2.0-0:amd64
libglib2.0-bin
libglib2.0-data
libglvnd0:amd64
libglx-mesa0:amd64
libglx0:amd64
libgmp10:amd64
libgnutls30:amd64
libgomp1:amd64
libgpg-error0:amd64
libgpm2:amd64
libgraphite2-3:amd64
libgs9:amd64
libgs9-common
libgssapi-krb5-2:amd64
libgstreamer1.0-0:amd64
libharfbuzz0b:amd64
libheif1:amd64
libhogweed6:amd64
libhttp-parser2.9:amd64
libice6:amd64
libicu70:amd64
libid3tag0:amd64
libidn12:amd64
libidn2-0:amd64
libijs-0.35:amd64
libilmbase25:amd64
libimlib2:amd64
libip4tc2:amd64
libip6tc2:amd64
libisc-export1105:amd64
libjansson4:amd64
libjbig0:amd64
libjbig2dec0:amd64
libjpeg-turbo8:amd64
libjpeg8:amd64
libjson-c5:amd64
libjxr-tools
libjxr0:amd64
libk5crypto3:amd64
libkeyutils1:amd64
libkmod2:amd64
libkrb5-3:amd64
libkrb5support0:amd64
libksba8:amd64
liblcms2-2:amd64
libldap-2.5-0:amd64
libldap-common
libllvm15:amd64
liblmdb0:amd64
liblocale-gettext-perl
liblqr-1-0:amd64
libltdl7:amd64
libluajit-5.1-2:amd64
libluajit-5.1-common
liblz4-1:amd64
liblzma5:amd64
liblzo2-2:amd64
libmagic-mgc
libmagic1:amd64
libmagickcore-6.q16-6:amd64
libmagickcore-6.q16-6-extra:amd64
libmagickwand-6.q16-6:amd64
libmaxminddb0:amd64
libmbedcrypto7:amd64
libmbedtls14:amd64
libmbedx509-1:amd64
libmd0:amd64
libmnl0:amd64
libmount1:amd64
libmpdec3:amd64
libmpfr6:amd64
libmsgpackc2:amd64
libncurses6:amd64
libncursesw6:amd64
libnetfilter-conntrack3:amd64
libnetpbm10
libnetplan0:amd64
libnettle8:amd64
libnewt0.52:amd64
libnfnetlink0:amd64
libnftables1:amd64
libnftnl11:amd64
libnghttp2-14:amd64
libnl-3-200:amd64
libnl-genl-3-200:amd64
libnpth0:amd64
libnsl2:amd64
libnspr4:amd64
libnss-systemd:amd64
libnss3:amd64
libntfs-3g89
libnuma1:amd64
libopenexr25:amd64
libopenjp2-7:amd64
libp11-kit0:amd64
libpackagekit-glib2-18:amd64
libpam-cap:amd64
libpam-modules:amd64
libpam-modules-bin
libpam-runtime
libpam-systemd:amd64
libpam0g:amd64
libpango-1.0-0:amd64
libpangocairo-1.0-0:amd64
libpangoft2-1.0-0:amd64
libpaper-utils
libpaper1:amd64
libparted2:amd64
libpcap0.8:amd64
libpci3:amd64
libpciaccess0:amd64
libpcre2-8-0:amd64
libpcre3:amd64
libpcsclite1:amd64
libperl5.34:amd64
libpipeline1:amd64
libpixman-1-0:amd64
libplymouth5:amd64
libpng16-16:amd64
libpolkit-agent-1-0:amd64
libpolkit-gobject-1-0:amd64
libpopt0:amd64
libprocps8:amd64
libpsl5:amd64
libpython3-stdlib:amd64
libpython3.10:amd64
libpython3.10-minimal:amd64
libpython3.10-stdlib:amd64
libreadline8:amd64
librtmp1:amd64
libsasl2-2:amd64
libsasl2-modules:amd64
libsasl2-modules-db:amd64
libseccomp2:amd64
libselinux1:amd64
libsemanage-common
libsemanage2:amd64
libsensors-config
libsensors5:amd64
libsepol2:amd64
libsigsegv2:amd64
libsixel-bin
libsixel1:amd64
libslang2:amd64
libsm6:amd64
libsmartcols1:amd64
libsodium23:amd64
libsqlite3-0:amd64
libss2:amd64
libssh-4:amd64
libssh2-1:amd64
libssl3:amd64
libstdc++6:amd64
libstemmer0d:amd64
libsystemd0:amd64
libtasn1-6:amd64
libtermkey1:amd64
libtext-charwidth-perl
libtext-iconv-perl
libtext-wrapi18n-perl
libthai-data
libthai0:amd64
libtiff5:amd64
libtinfo6:amd64
libtirpc-common
libtirpc3:amd64
libtree-sitter0:amd64
libuchardet0:amd64
libudev1:amd64
libunibilium4:amd64
libunistring2:amd64
libunwind8:amd64
libusb-1.0-0:amd64
libutempter0:amd64
libuuid1:amd64
libuv1:amd64
libvterm0:amd64
libwebp7:amd64
libwebpdemux2:amd64
libwebpmux3:amd64
libwmflite-0.2-7:amd64
libx11-6:amd64
libx11-data
libx11-xcb1:amd64
libx265-199:amd64
libxau6:amd64
libxaw7:amd64
libxcb-dri2-0:amd64
libxcb-dri3-0:amd64
libxcb-glx0:amd64
libxcb-present0:amd64
libxcb-randr0:amd64
libxcb-render0:amd64
libxcb-shape0:amd64
libxcb-shm0:amd64
libxcb-sync1:amd64
libxcb-xfixes0:amd64
libxcb1:amd64
libxcomposite1:amd64
libxdmcp6:amd64
libxext6:amd64
libxfixes3:amd64
libxft2:amd64
libxi6:amd64
libxinerama1:amd64
libxkbfile1:amd64
libxml2:amd64
libxmlb2:amd64
libxmu6:amd64
libxmuu1:amd64
libxpm4:amd64
libxrandr2:amd64
libxrender1:amd64
libxshmfence1:amd64
libxt6:amd64
libxtables12:amd64
libxtst6:amd64
libxv1:amd64
libxxf86dga1:amd64
libxxf86vm1:amd64
libxxhash0:amd64
libyaml-0-2:amd64
libzstd1:amd64
locales
login
logrotate
logsave
lsb-base
lsb-release
lshw
lsof
lua-luv:amd64
mailcap
man-db
manpages
mawk
mc
mc-data
media-types
mime-support
motd-news-config
mount
mtr-tiny
nano
ncurses-base
ncurses-bin
neofetch
neovim
neovim-runtime
netbase
netcat-openbsd
netpbm
netplan.io
networkd-dispatcher
nftables
ntfs-3g
openjdk-11-jre:amd64
openjdk-11-jre-headless:amd64
openssh-client
openssl
packagekit
packagekit-tools
parted
passwd
pastebinit
patch
pci.ids
pciutils
perl
perl-base
perl-modules-5.34
pigz
pinentry-curses
pkexec
plymouth
plymouth-theme-ubuntu-text
policykit-1
polkitd
poppler-data
powermgmt-base
procps
psmisc
publicsuffix
python-apt-common
python3
python3-apport
python3-apt
python3-attr
python3-blinker
python3-certifi
python3-cffi-backend:amd64
python3-chardet
python3-commandnotfound
python3-cryptography
python3-dbus
python3-distro
python3-distro-info
python3-distupgrade
python3-distutils
python3-docker
python3-dockerpty
python3-docopt
python3-dotenv
python3-gdbm:amd64
python3-gi
python3-greenlet
python3-httplib2
python3-idna
python3-importlib-metadata
python3-jeepney
python3-jsonschema
python3-jwt
python3-keyring
python3-launchpadlib
python3-lazr.restfulclient
python3-lazr.uri
python3-lib2to3
python3-minimal
python3-more-itertools
python3-msgpack
python3-neovim
python3-netifaces:amd64
python3-newt:amd64
python3-oauthlib
python3-pkg-resources
python3-problem-report
python3-pynvim
python3-pyparsing
python3-pyrsistent:amd64
python3-requests
python3-secretstorage
python3-setuptools
python3-six
python3-software-properties
python3-systemd
python3-texttable
python3-update-manager
python3-urllib3
python3-wadllib
python3-websocket
python3-yaml
python3-zipp
python3.10
python3.10-minimal
readline-common
rsync
rsyslog
run-one
runc
screen
sed
sensible-utils
session-migration
shared-mime-info
show-motd
snapd
software-properties-common
squashfs-tools
strace
sudo
systemd
systemd-hwe-hwdb
systemd-sysv
systemd-timesyncd
sysvinit-utils
tar
tcpdump
telnet
time
tmux
tnftp
toilet
toilet-fonts
tzdata
ubuntu-advantage-tools
ubuntu-fan
ubuntu-keyring
ubuntu-minimal
ubuntu-release-upgrader-core
ubuntu-standard
ubuntu-wsl
ucf
udev
ufw
unattended-upgrades
unzip
update-manager-core
update-motd
usb.ids
usbutils
usrmerge
util-linux
uuid-runtime
vim
vim-common
vim-runtime
vim-tiny
w3m
w3m-img
wget
whiptail
wsl-setup
x11-common
x11-utils
xauth
xclip
xdg-user-dirs
xkb-data
xxd
xz-utils
zlib1g:amd64
zsh
zsh-common
